In [192]:
import pandas as pd
from sodapy import Socrata
from dotenv import load_dotenv
import os
from datetime import datetime
from sqlalchemy import create_engine, text, MetaData, Table, Column, String, Integer, Date, ForeignKey

In [193]:
import pandas as pd
from sodapy import Socrata
from dotenv import load_dotenv
import os
from datetime import datetime
from sqlalchemy import create_engine, text

client = Socrata("data.cityofnewyork.us", None)

# First 2000 results, returned as JSON from API / converted to Python list of
# dictionaries by sodapy.
limit = 10000
results = client.get("43nn-pn8j", limit=limit)

# Convert to pandas DataFrame
results_df = pd.DataFrame.from_records(results)

WARNING:root:Requests made without an app_token will be subject to strict throttling limits.

In [194]:
results_df['action'].value_counts()

action
Violations were cited in the following area(s).                                                                                       8516
Establishment Closed by DOHMH. Violations were cited in the following area(s) and those requiring immediate action were addressed.     307
No violations were recorded at the time of this inspection.                                                                            123
Establishment re-opened by DOHMH.                                                                                                       76
Establishment re-closed by DOHMH.                                                                                                       59
Name: count, dtype: int64

In [195]:
results_df.head()

,camis,dba,boro,building,street,phone,cuisine_description,inspection_date,action,violation_code,...,community_board,council_district,census_tract,bin,nta,location,:@computed_region_f5dn_yrer,:@computed_region_yeji_bk3q,:@computed_region_sbqj_enih,:@computed_region_92fq_4b7q
0,41032752,DONS BOGAM,Manhattan,1517,EAST 32 STREET,2126832200,Korean,2025-02-19T00:00:00.000,Violations were cited in the following area(s).,02B,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,50158848,AURA 57,Manhattan,130,EAST 57 STREET,9173882963,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,105,04,011203,1036890,MN19,"{'type': 'Point', 'coordinates': [-73.96948654...",11,4,10,51
2,50164505,DUBUHAUS,Manhattan,6,EAST 32 STREET,9178600745,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,105,04,007400,1017003,MN17,"{'type': 'Point', 'coordinates': [-73.98505869...",11,4,8,51
3,50121723,FRYING PAN WHEELHOUSE,Brooklyn,33,35 STREET,9178802190,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,307,38,001800,3336900,BK32,"{'type': 'Point', 'coordinates': [-74.00735241...",9,2,45,7
4,50172970,SPIRALS,Manhattan,137,1 AVENUE,2013672187,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,103,02,003800,1077697,MN22,"{'type': 'Point', 'coordinates': [-73.98513516...",70,4,5,50

In [196]:
results_df.columns

Index(['camis', 'dba', 'boro', 'building', 'street', 'phone',
       'cuisine_description', 'inspection_date', 'action', 'violation_code',
       'violation_description', 'critical_flag', 'score', 'grade',
       'grade_date', 'record_date', 'inspection_type', 'latitude', 'longitude',
       'bbl', 'zipcode', 'community_board', 'council_district', 'census_tract',
       'bin', 'nta', 'location', ':@computed_region_f5dn_yrer',
       ':@computed_region_yeji_bk3q', ':@computed_region_sbqj_enih',
       ':@computed_region_92fq_4b7q'],
      dtype='object')

In [197]:
# replace '0' in the 'boro' column with 'Unknown'
results_df['boro'] = results_df['boro'].replace('0', 'Unknown')
results_df['boro'].value_counts()

boro
Manhattan        3747
Brooklyn         2609
Queens           2401
Bronx             900
Staten Island     332
Unknown            11
Name: count, dtype: int64

In [198]:
unnecessary_columns = [':@computed_region_f5dn_yrer', ':@computed_region_yeji_bk3q', ':@computed_region_sbqj_enih', ':@computed_region_92fq_4b7q']
results_df.drop(columns=unnecessary_columns, inplace=True)

In [199]:
results_df.head()

,camis,dba,boro,building,street,phone,cuisine_description,inspection_date,action,violation_code,...,latitude,longitude,bbl,zipcode,community_board,council_district,census_tract,bin,nta,location
0,41032752,DONS BOGAM,Manhattan,1517,EAST 32 STREET,2126832200,Korean,2025-02-19T00:00:00.000,Violations were cited in the following area(s).,02B,...,0,0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,50158848,AURA 57,Manhattan,130,EAST 57 STREET,9173882963,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,40.761061935614,-73.96948654606,1013110058,10022,105,04,011203,1036890,MN19,"{'type': 'Point', 'coordinates': [-73.96948654..."
2,50164505,DUBUHAUS,Manhattan,6,EAST 32 STREET,9178600745,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,40.746951463756,-73.985058696576,1008610072,10016,105,04,007400,1017003,MN17,"{'type': 'Point', 'coordinates': [-73.98505869..."
3,50121723,FRYING PAN WHEELHOUSE,Brooklyn,33,35 STREET,9178802190,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,40.657011546891,-74.007352417094,3006870001,11232,307,38,001800,3336900,BK32,"{'type': 'Point', 'coordinates': [-74.00735241..."
4,50172970,SPIRALS,Manhattan,137,1 AVENUE,2013672187,NaN,1900-01-01T00:00:00.000,NaN,NaN,...,40.72781498039,-73.985135163126,1004500033,10003,103,02,003800,1077697,MN22,"{'type': 'Point', 'coordinates': [-73.98513516..."

In [200]:
def transform_date_columns(df, date_columns):
    for col in date_columns:
        df[col] = pd.to_datetime(df[col])
        df[col] = df[col].dt.strftime('%Y-%m-%d')
    return df

results_df = transform_date_columns(results_df, ['inspection_date', 'grade_date', 'record_date'])

In [201]:
results_df['inspection_date'].value_counts()

inspection_date
1900-01-01    919
2024-12-17     26
2025-01-14     26
2024-06-13     25
2024-01-31     24
             ...
2024-06-16      1
2023-07-14      1
2023-01-29      1
2023-09-22      1
2021-09-10      1
Name: count, Length: 1169, dtype: int64

In [202]:
results_df['violation_code'].value_counts()

violation_code
10F      1206
08A       838
06C       587
06D       566
10B       562
         ...
22A         1
03C         1
16L         1
03G         1
16-08       1
Name: count, Length: 102, dtype: int64

In [203]:
results_df.fillna({'violation_code': 'N/A', 'violation_description': 'No violation description available'}, inplace=True)
violation_codes_df = results_df[['violation_code', 'violation_description']].drop_duplicates(subset=['violation_code']).reset_index(drop=True)
violation_codes_df

    violation_code                              violation_description
0              02B     Hot TCS food item not held at or above 140 Â°F.
1              N/A                 No violation description available
2            18-11  Food Protection Certificate not available for ...
3              04K  Evidence of rats or live rats in establishment...
4              04M  Live roaches in facility's food or non-food area.
..             ...                                                ...
98             22C  Bulb not shielded or shatterproof, in areas wh...
99             16B  The original nutritional fact labels and/or in...
100          20-07  Letter grade or Grade Pending card removed, de...
101            03E  No or inadequate potable water supply. Water o...
102          16-08  Sodium Warning icon not posted on menus, menu ...

[103 rows x 2 columns]

In [204]:
cuisines_df = results_df[['cuisine_description']].drop_duplicates().dropna().reset_index(drop=True)
cuisines_df

          cuisine_description
0                      Korean
1                     Mexican
2                     African
3                  Coffee/Tea
4              Latin American
..                        ...
83              Haute Cuisine
84                    Hotdogs
85  Not Listed/Not Applicable
86                 Portuguese
87                 Polynesian

[88 rows x 1 columns]

In [205]:
restaurants_df = results_df[['dba', 'camis', 'building', 'street', 'zipcode', 'boro', 'phone', 'cuisine_description']].drop_duplicates().reset_index(drop=True)
restaurants_df

,dba,camis,building,street,zipcode,boro,phone,cuisine_description
0,DONS BOGAM,41032752,1517,EAST 32 STREET,NaN,Manhattan,2126832200,Korean
1,AURA 57,50158848,130,EAST 57 STREET,10022,Manhattan,9173882963,NaN
2,DUBUHAUS,50164505,6,EAST 32 STREET,10016,Manhattan,9178600745,NaN
3,FRYING PAN WHEELHOUSE,50121723,33,35 STREET,11232,Brooklyn,9178802190,NaN
4,SPIRALS,50172970,137,1 AVENUE,10003,Manhattan,2013672187,NaN
...,...,...,...,...,...,...,...,...
8174,UBANI,50112225,37A,BEDFORD STREET,10014,Manhattan,6466785595,Eastern European
8175,MONOMONO,50077626,116,EAST 4 STREET,10003,Manhattan,9172855034,Asian/Asian Fusion
8176,CHEN'S BROTHER CUISINE,50138024,95,WATER STREET,10304,Staten Island,9176358307,Chinese
8177,FAIRFIELD INN & SUITES NEW YORK MANHATTAN FINA...,50017223,161,FRONT STREET,10038,Manhattan,6467685998,Continental
8178,AUDI YANKEE CLUB,41396855,1,EAST 161 STREET,10451,Bronx,9172843260,American

In [206]:
# Created a Supabase DB to store restaurant and violation code data

def connect_to_db():
    load_dotenv(override=True)
    PASSWORD = os.getenv("DB_PASSWORD")
    DB_URL = os.getenv("DB_URL")
    connection_string = f'postgresql://postgres:{PASSWORD}@db.{DB_URL}.supabase.co:5432/postgres'
    return create_engine(connection_string, connect_args={"sslmode": "require"})

engine = connect_to_db()

try:
    engine.connect()
    print("Connected to DB successfully!")
except Exception as e:
    print(e)

def insert_table(df, table_name, primary_key):
    with engine.connect() as conn:
        conn.execute(text(f"DROP TABLE IF EXISTS {table_name} CASCADE;"))
        conn.commit()

    df.to_sql(table_name, engine, if_exists='replace', index=False)

    with engine.connect() as conn:
        conn.execute(text(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({primary_key});"))
        conn.commit()

RESTAURANT_TABLE = 'restaurants'
VIOLATION_CODE_TABLE = 'violation_codes'
RESTAURANT_PRIMARY_KEY = 'camis'
VIOLATION_CODE_PRIMARY_KEY = 'violation_code'
MAPPING_TABLE = 'rest_to_violations'

insert_table(restaurants_df, RESTAURANT_TABLE, RESTAURANT_PRIMARY_KEY)
insert_table(violation_codes_df, VIOLATION_CODE_TABLE, VIOLATION_CODE_PRIMARY_KEY)

Connected to DB successfully!

In [207]:
drop_sql_query = f"""
DROP TABLE IF EXISTS {MAPPING_TABLE};
"""

with engine.connect() as conn:
    conn.execute(text(drop_sql_query))
    conn.commit()


create_sql_query = f"""
CREATE TABLE {MAPPING_TABLE} (
    camis TEXT REFERENCES {RESTAURANT_TABLE}(camis),
    violation_code TEXT REFERENCES {VIOLATION_CODE_TABLE}(violation_code),
    inspection_date DATE DEFAULT '1900-01-01',
    action TEXT DEFAULT NULL,
    critical_flag TEXT DEFAULT 'Not Applicable',
    grade TEXT DEFAULT NULL,
    score INTEGER DEFAULT NULL,
    grade_date DATE DEFAULT NULL,
    record_date DATE DEFAULT CURRENT_DATE,
    inspection_type TEXT DEFAULT NULL,
    PRIMARY KEY (camis, violation_code, inspection_date)
);
"""

with engine.connect() as conn:
    conn.execute(text(create_sql_query))
    conn.commit()

print("restaurants to violations mapping table created")

restaurants to violations mapping table created

In [208]:
metadata = MetaData()

restaurant_to_violations = Table(
    'rest_to_violations', metadata,
    Column('camis', String, ForeignKey('restaurants.camis'), primary_key=True),
    Column('violation_code', String, ForeignKey('violations.violation_code'), primary_key=True),
    Column('inspection_date', String, primary_key=True),
    Column('grade', String),
    Column('score', Integer),
    Column('grade_date', Date),
    Column('record_date', Date),
    Column('inspection_type', String)
)

metadata.create_all(engine)

# extract only columns relevant to the mapping table

features = results_df.columns.tolist()
features = [
    'camis',
    'inspection_date',
    'action',
    'violation_code',
    'critical_flag',
    'score',
    'grade',
    'grade_date',
    'record_date',
    'inspection_type'
]

mapping_df = results_df[features]
mapping_df

,camis,inspection_date,action,violation_code,critical_flag,score,grade,grade_date,record_date,inspection_type
0,41032752,2025-02-19,Violations were cited in the following area(s).,02B,Critical,13,A,2025-02-19,2025-10-29,Cycle Inspection / Re-inspection
1,50158848,1900-01-01,NaN,N/A,Not Applicable,NaN,NaN,NaN,2025-10-29,NaN
2,50164505,1900-01-01,NaN,N/A,Not Applicable,NaN,NaN,NaN,2025-10-29,NaN
3,50121723,1900-01-01,NaN,N/A,Not Applicable,NaN,NaN,NaN,2025-10-29,NaN
4,50172970,1900-01-01,NaN,N/A,Not Applicable,NaN,NaN,NaN,2025-10-29,NaN
...,...,...,...,...,...,...,...,...,...,...
9995,50146557,2025-01-14,Violations were cited in the following area(s).,02H,Critical,19,NaN,NaN,2025-10-29,Cycle Inspection / Initial Inspection
9996,50138024,2023-12-12,Violations were cited in the following area(s).,06C,Critical,69,NaN,NaN,2025-10-29,Pre-permit (Operational) / Initial Inspection
9997,50108157,2023-04-18,Violations were cited in the following area(s).,05D,Critical,34,NaN,NaN,2025-10-29,Cycle Inspection / Initial Inspection
9998,50017223,2023-05-09,Violations were cited in the following area(s).,20-08,Not Critical,NaN,NaN,NaN,2025-10-29,Administrative Miscellaneous / Initial Inspection
9999,41396855,2024-09-27,No violations were recorded at the time of thi...,N/A,Not Applicable,0,A,2024-09-27,2025-10-29,Cycle Inspection / Initial Inspection

In [209]:
mapping_df.to_sql(MAPPING_TABLE, con=engine, if_exists='append', index=False)

with engine.connect() as conn:
    rows = conn.execute(text(f"SELECT * FROM {MAPPING_TABLE};")).fetchall()

if len(rows) != limit:
    print(f"Warning: Expected {limit} rows, but got {len(rows)}")
else:
    print("Success: All rows were inserted into the mapping table")

Success: All rows were inserted into the mapping table

In [210]:
# TODO: Handle append to mapping table
# TODO: Handle duplicate rows in mapping table